{
    "0.6.0":"---Date: 31/7/2021\n\n> **Added**:\n**;status**\nDescription: Sends a message containing different information regarding the bot's connection.\nUsage: ;status\nCategory: other\nCooldown: 10s\n\n**;events**\nDescription: Directly connected to the `;host` command. It shows you what events are being hosted using the first command. Current max amount is 2.\nUsage: ;events\nCategory: ms\nCooldown: 5s\n\n**;news**\nDescription: Shows you the latest update for the bot.\nUsage: ;news\nCategory: other\n Cooldown: s3\n\n**Points logs**\nDescription: Every commands that modifies other users' points will be logged in this new logging channel.\nUsage: Accessible through `;logs`\n\n**Events logs**\nDescription: Every Interaction with the command `;host` will be logged in this logging channel.\nUsage: Accessible through `;logs`\n\n\n> **Changed:**\n*Changed some texts in the `;help` command.\n *Changed the way `;host` work. Now has a maximum of 2 events and every usage of the command will be logged in a new log called \"events logs\" ( accessible through the `;logs` command )\n *Changed some texts in `;logs`   `;server` `;help`\n*If you want to use points, you will not have to manually enable them using `;points-enable` any more. In fact, the commands `;points-enable` and `;opoints-enable` have been removed due to it being automated.\n*`;ping` is removed and replaced with `;status`\n*`;help` is now easier to interact with and invites you to our hub server.\n *Changed some texts in `;sync`\n*Minor bug fixes related to the console spamming false errors.\n",
    "0.6.1":"---Date: 6/8/2021\n\n> **Added:**\n**;welcome-message**\nDescription: Changes the messages sent by the bot when a member joins/leaves the server.\nUsage: ;welcome-message\nCategory: config\nCooldown: 10s\n\n\n> **Changed:**\n*Improved the channel updates logging.\n*Changed the way `;logs` and `;server` work. Now they will show you a menu of options to choose from to edit instead of asking you directly asking to change without explain.*Added global command cooldowns (only for `;server` and `;logs` since they are the biggest commands in the bot) to prevent multiple requests at the same time.\n*The cooldown message will show you how much time remaining instead of showing you the cooldown time.\n*Renamed the `ms` category to `tsu`\n*Renamed the `warn logs` to `moderations logs` and more logging triggers will be added in the future.\n*`;news` now has a cooldown of 30 seconds and the message sent by the bot will get deleted after 2 minutes to prevent flooding.\n*`;mute` now skips the server booster role instead of giving up entirely and not muting at all.\n*Some general text changes.\n*`;news` now links to the github repository of the bot.\n*The bot now changes its status to different sentences every 30 minutes 👀",
    "0.6.2":"---Date: 9/8/2021\n\n> **Added:**\n*No new features were introduced.\n\n\n> **Changed:**\n*If you try to run a whitelisted command and you don't have the permission needed, the bot will tell you that you are missing that permission\n*When a member updates, all of the changed roles will be mentioned (instead of only one before)\n*`;mute` will now completely bypass server booster role, bot roles and @ everyone role.\n*You now cannot mute a person that is already muted using `;mute`.\n*[reason] is now an optional argument in `;ban`\n*[reason] is now an optional argument in `;unban`\n*[reason] is now an optional argument in `;kick`\n*[reason] is now an optional argument in `;mute`\n*[time] is now an optional argument in `;mute` (default is 30 minutes)\n*[time] is now defaulted to 1 day in `;ban`\n*`;rick-roll` has now different messages and tricks :eyes: \n\n\n\n**Changed to disord.js V13.**\nThis means that everything in the bot has been changed and edited to fit the new version of discord.js. It's very possible that you encounter bugs, so if you do, please inform the developer \"Crazy4k#0091\" ASAP.\nThis also means that new discord features will be added, like slash commands, threads, stickers and whatnot.\nI will spend the next few days fixing any leftover issues to prepare for new features back again.\n",
    "0.6.3":"---Date: 18/8/2021\n\n> **Added:**\n*No new features were introduced.\n\n\n> **Changed:**\n*Added a cooldown for all commands that will be executed to matter what the results of the command were. Length: 2 seconds.\n*Changed some texts.\n*`;rick-roll` doesn't send messages to bots anymore.\n*Minor bug fixes\n",
    "0.6.4":"---Date 30/8/2021\n\n> **Added**:\n*`;pointsbatch-add`:\nAdds points to users in batch mode. Up to possible 25 users per batch.\nExample: `;pointsbatch-add @user amount reason | @user amount reason | @user amount reason`\n*`;pointsbatch-remove`:\nRemoves points from users in batch mode. Up to possible 25 users per batch.\nExample: `;pointsbatch-remove @user amount reason | @user amount reason | @user amount reason`\n*A very new and exciting system called.... Points promotion!!!\nFrom now on, if an admin in the server added roles to the bot that can be earned using points, the bot will automatically give the roles to people when they reach that amount of points.\nIt can edited using the new `;rewards-set` command that is only for admins to use\n\n\n\nChanged:\n*All points command will increase in cooldown due to the fact that all of them will be more resource extensive.\n*Changed some texts.\n *Using a new line \"\\n\" will function exactly like a spcae bar from now on instead of being treated as a character\n*It's no longer possible to go below 0 points\n",
    "0.6.5":"---Date 31/8/2021\n\n> **Added**:\n*`;slowmode`:\nA new way for mod to change the slowmode of any channel to any time from 1 second - 6 hours.\n Requires channel managing permissions.\n\n\n\nChanged:\n*`;help` now shows command aliases and the required permission to the a command.\n*`;copy`, `;sudo`, `;rr` now have a server wide cooldown applied to them(this is to prevent spam).\n*All commands in the bot can now accept a nickname/tag as an argument instead of a ping or id as a user.\nExample: \";avatar user\" works exactly like \";avatar @user\" or \";avatar 881885038407458846\"\n*Minor fixes to the last update.",
    "0.6.6":"---Date 18/9/2021\n\n> **Added**:\n*`;AoSinTSU`:\nA command that searches through all current AoS and KoS groups for branch members like RA, Mili and CPSU.\nThis is useful for TSU HIcoms who want to enforce the \"Membership of an Illegal Organisation\" rule.\n\n*`;raiders`:\nA way for you to see AoS/KoS raiders who are online at the moment. Works similarly to a tracker.\n**Only shows those who are playing ms1 and have their joins set to \"everyone can join\"**\n\n*Some commands will now be executable in DMs with the bot.\n\n\n\nChanged:\n*All points commands have increased 2 seconds in cool down.\n*Changed the way the bot caches data.\n*Using `;mute`,`;ban`, `;kick`, `;unban`, `;slowmode`, and `;unmute` will now be logged in moderation logs that can be found in `;logs`\n*The bot now reports errors privately to the developer so they can be tracked quickly and get fixed.\n*The bot is now on a new host which means very stable run time.\n*Fixed an issue regarding the points promotion system giving max role people roles over and over again.\n*Fixed many small issues\n*Some text changes\n*;SUS\n i forgot the rest ☠",
    "0.6.7":"---Date 1/10/2021\n\n> **Added**:\n***Raider tracker :eye:**:\nA new way to track raiders with an AoS/KoS tag when they join MS1 or 2. It uses Roblox API and tracks their joins to MS1 and 2 only , so it doesn't violate any ToS. You can enable it in your servers now with the new `;trackers` command. (To set up a rank, simply create a role with the name \"raider_pings\")\n\nIf you want to know how many raiders are currently online, you can do so with the `;raiders` command.\n\n\n\nChanged:\n*Added a `Roblox` category including all the Roblox related commands.\n*Changed/removed some aliases from some commands.\n*`;AoSinTSU` is much more faster now.\n",
    "0.6.7.1":"---Date 4/10/2021\n\n\n> **Changed:**\n*Changed some command descriptions that were outdated.\n*Renamed a command to `;dice`\n*Decreased some command cool down timers that were too long for no reason.\n\n\n> **Fixed**:\n*Fixed a bug in tracker that was sending too many messages, that  continuously crashed the bot whenever it booted.\n*Fixed a bug that resulted in the bot sending messages that were above the limit, which resulted in the bot crashing.\n*(Hopefully) fixed a bug with `;AoSinTSU` that crashed the bot.\n"
}